In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
dict1={'Names':['begam','mahi',np.nan],
       'age':[2,np.nan,4],
       'city':[np.nan,'blr','pune']}
df=pd.DataFrame(dict1)
df

   Names  age  city
0  begam  2.0   NaN
1   mahi  NaN   blr
2    NaN  4.0  pune

In [5]:
df.isnull()

   Names    age   city
0  False  False   True
1  False   True  False
2   True  False  False

In [6]:
df.isnull().sum()

Names    1
age      1
city     1
dtype: int64

In [7]:
df.isnull().sum().count()

3

In [10]:
df.isna()

   Names    age   city
0  False  False   True
1  False   True  False
2   True  False  False

In [11]:

df.isna().sum()

Names    1
age      1
city     1
dtype: int64

In [12]:

df.isna().sum().count()

3

In [13]:
df.fillna(4)

   Names  age  city
0  begam  2.0     4
1   mahi  4.0   blr
2      4  4.0  pune

In [14]:
df

   Names  age  city
0  begam  2.0   NaN
1   mahi  NaN   blr
2    NaN  4.0  pune

In [15]:
df.fillna(4,inplace=True)
df

   Names  age  city
0  begam  2.0     4
1   mahi  4.0   blr
2      4  4.0  pune

In [18]:
dict1={'Names':['begam','mahi',np.nan],
       'age':[2,np.nan,4],
       'city':[np.nan,'blr','pune']}
df=pd.DataFrame(dict1)
df

   Names  age  city
0  begam  2.0   NaN
1   mahi  NaN   blr
2    NaN  4.0  pune

In [20]:
df['Names'].fillna('rom',inplace=True)
df

/tmp/ipykernel_5239/148557176.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Names'].fillna('rom',inplace=True)

   Names  age  city
0  begam  2.0   NaN
1   mahi  NaN   blr
2    rom  4.0  pune

In [21]:
dict1={'Names':['begam','mahi',np.nan],
       'age':[2,np.nan,4],
       'city':[np.nan,'blr','pune']}
df=pd.DataFrame(dict1)

df

   Names  age  city
0  begam  2.0   NaN
1   mahi  NaN   blr
2    NaN  4.0  pune

In [28]:
print(df)
print('========pad=========')
print(df.fillna(method='pad'))
print('=========bfill========')
print(df.fillna(method='bfill'))
print('========ffill=========')
print(df.fillna(method='ffill'))
print('========backfill=========')
print(df.fillna(method='backfill'))

   Names  age  city
0  begam  2.0   NaN
1   mahi  NaN   blr
2    NaN  4.0  pune
========pad=========
   Names  age  city
0  begam  2.0   NaN
1   mahi  2.0   blr
2   mahi  4.0  pune
=========bfill========
   Names  age  city
0  begam  2.0   blr
1   mahi  4.0   blr
2    NaN  4.0  pune
========ffill=========
   Names  age  city
0  begam  2.0   NaN
1   mahi  2.0   blr
2   mahi  4.0  pune
========backfill=========
   Names  age  city
0  begam  2.0   blr
1   mahi  4.0   blr
2    NaN  4.0  pune

/tmp/ipykernel_5239/2920360307.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method='pad'))
/tmp/ipykernel_5239/2920360307.py:5: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method='bfill'))
/tmp/ipykernel_5239/2920360307.py:7: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method='ffill'))
/tmp/ipykernel_5239/2920360307.py:9: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method='backfill'))

In [31]:
df.fillna(method='bfill',axis=1)

/tmp/ipykernel_5239/3381026564.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill',axis=1)

   Names  age  city
0  begam  2.0   NaN
1   mahi  blr   blr
2    4.0  4.0  pune

In [32]:
df.fillna(method='pad',axis=1)

/tmp/ipykernel_5239/297991498.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='pad',axis=1)

   Names   age  city
0  begam   2.0   2.0
1   mahi  mahi   blr
2    NaN   4.0  pune